____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 44, 2452)      0                                            
____________________________________________________________________________________________________
input_3 (InputLayer)             (None, 512)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1000)          513000      input_3[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 1000)          513000      input_3[0][0]                    
____________________________________________________________________________________________________
input_2 (InputLayer)             (None, 196, 512)      0                                            
____________________________________________________________________________________________________
timedistributed_1 (TimeDistribute(None, 44, 512)       1255936     input_1[0][0]                    
____________________________________________________________________________________________________
attentionlstm_1 (AttentionLSTM)  (None, 44, 512)       3677185     timedistributed_1[0][0]          
                                                                   dense_1[0][0]                    
                                                                   dense_2[0][0]                    
                                                                   input_2[0][0]                    
____________________________________________________________________________________________________
timedistributed_2 (TimeDistribute(None, 44, 2452)      1257876     attentionlstm_1[0][0]            
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 44, 2452)      0           timedistributed_2[0][0]          
====================================================================================================
Total params: 7216997
____________________________________________________________________________________________________